[Timeout] StringLiteral
src/components/cardEvent/styles.ts:45:33
   padding-left: 6px;
 `;
 
-export const Link = styled(Text)`
-  font-size: 12px;
-  text-decoration: underline;
-  color: ${theme.colors.primary.MAIN};
-  padding-left: 8px;
-  padding-top: 8px;
-`;
+export const Link = styled(Text)``;
 
