[Timeout] BlockStatement
src/hooks/Auth/auth.hook.tsx:7:73
 
 const AuthContext = createContext<IAuthData>({} as IAuthData);
 
-const AuthProvider: React.FC<React.PropsWithChildren> = ({children}) => {
-  // eslint-disable-next-line @typescript-eslint/no-unused-vars
-  const [logged, setLogged] = useState<boolean>(false);
-
-  return (
-    <AuthContext.Provider value={{logged}}>{children}</AuthContext.Provider>
-  );
-};
+const AuthProvider: React.FC<React.PropsWithChildren> = ({children}) => {};
 
 function useAuth(): IAuthData {

[Timeout] BooleanLiteral
src/hooks/Auth/auth.hook.tsx:9:49
 
 const AuthProvider: React.FC<React.PropsWithChildren> = ({children}) => {
   // eslint-disable-next-line @typescript-eslint/no-unused-vars
-  const [logged, setLogged] = useState<boolean>(false);
+  const [logged, setLogged] = useState<boolean>(true);
 
   return (

[Timeout] BlockStatement
src/hooks/Auth/auth.hook.tsx:16:31
   );
 };
 
-function useAuth(): IAuthData {
-  const context = useContext(AuthContext);
-
-  if (!context) {
-    throw new Error('useAuth must be used with AuthProvider');
-  }
-
-  return context;
-}
+function useAuth(): IAuthData {}
 
 export {AuthProvider, useAuth};

[Timeout] BlockStatement
src/hooks/Auth/auth.hook.tsx:19:17
 function useAuth(): IAuthData {
   const context = useContext(AuthContext);
 
-  if (!context) {
-    throw new Error('useAuth must be used with AuthProvider');
-  }
+  if (!context) {}
 
   return context;

[Timeout] BooleanLiteral
src/hooks/Auth/auth.hook.tsx:19:7
 function useAuth(): IAuthData {
   const context = useContext(AuthContext);
 
-  if (!context) {
+  if (context) {
     throw new Error('useAuth must be used with AuthProvider');
   }
