[Timeout] BlockStatement
src/pages/Login/login.page.tsx:7:31
 import {CustomButton, InputCustom} from '@/components';
 import {useNavigation} from '@react-navigation/native';
 
-const Login: React.FC = () => {
-  const {navigate} = useNavigation();
-  return (
-    <S.Container>
-      <S.ContentLogo>
-        <S.TitleLogo>Airsoft</S.TitleLogo>
-        <S.SubtitleLogo>CommunityBR</S.SubtitleLogo>
-      </S.ContentLogo>
-      <S.ContentForm>
-        <InputCustom type="text" placeholder="Insira seu email..." />
-        <InputCustom type="password" placeholder="Insira sua senha..." />
-        <CustomButton onPress={() => {}} size="lg" title="ENTRAR" />
-        <S.ContentOpt>
-          <S.Redirect1 onPress={() => navigate('Register')}>
-            <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
-          </S.Redirect1>
-          <S.Redirect1 onPress={() => navigate('Forgot')}>
-            <S.SubtitleLogo>Esqueceu a senha?</S.SubtitleLogo>
-          </S.Redirect1>
-        </S.ContentOpt>
-      </S.ContentForm>
-    </S.Container>
-  );
-};
+const Login: React.FC = () => {};
 
 export default Login;

[Timeout] StringLiteral
src/pages/Login/login.page.tsx:20:48
         <InputCustom type="password" placeholder="Insira sua senha..." />
         <CustomButton onPress={() => {}} size="lg" title="ENTRAR" />
         <S.ContentOpt>
-          <S.Redirect1 onPress={() => navigate('Register')}>
+          <S.Redirect1 onPress={() => navigate("")}>
             <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
           </S.Redirect1>

[Timeout] ArrowFunction
src/pages/Login/login.page.tsx:23:33
           <S.Redirect1 onPress={() => navigate('Register')}>
             <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
           </S.Redirect1>
-          <S.Redirect1 onPress={() => navigate('Forgot')}>
+          <S.Redirect1 onPress={() => undefined}>
             <S.SubtitleLogo>Esqueceu a senha?</S.SubtitleLogo>
           </S.Redirect1>

[Timeout] StringLiteral
src/pages/Login/login.page.tsx:23:48
           <S.Redirect1 onPress={() => navigate('Register')}>
             <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
           </S.Redirect1>
-          <S.Redirect1 onPress={() => navigate('Forgot')}>
+          <S.Redirect1 onPress={() => navigate("")}>
             <S.SubtitleLogo>Esqueceu a senha?</S.SubtitleLogo>
           </S.Redirect1>
