[Timeout] BlockStatement
src/App.provider.tsx:9:72
 import {theme} from '@/styles';
 import {AuthProvider} from '@/hooks';
 
-const AppProvider: React.FC<React.PropsWithChildren> = ({children}) => {
-  return (
-    <ThemeProvider theme={theme}>
-      <AuthProvider>
-        <Routes>{children}</Routes>
-      </AuthProvider>
-    </ThemeProvider>
-  );
-};
+const AppProvider: React.FC<React.PropsWithChildren> = ({children}) => {};
 
 export {AppProvider};
