[Timeout] StringLiteral
src/pages/Login/styles.ts:25:41
   color: ${theme.colors.common.WHITE};
 `;
 
-export const SubtitleLogo = styled(Text)`
-  font-size: 16px;
-  font-weight: 600;
-  color: ${theme.colors.primary.MAIN};
-`;
+export const SubtitleLogo = styled(Text)``;
 
 export const ContentForm = styled(View)`
