[Timeout] ArrowFunction
src/App.tsx:9:54
 import {SafeArea, theme} from './styles';
 import Routes from './routes';
 
-const Providers: React.FC<React.PropsWithChildren> = ({children}) => (
-  <ThemeProvider theme={theme}>
-    <AuthProvider>
-      <Routes>{children}</Routes>
-    </AuthProvider>
-  </ThemeProvider>
-);
+const Providers: React.FC<React.PropsWithChildren> = () => undefined;
 
 const App: React.FC<React.PropsWithChildren> = ({children}) => {

[Timeout] BlockStatement
src/App.tsx:17:64
   </ThemeProvider>
 );
 
-const App: React.FC<React.PropsWithChildren> = ({children}) => {
-  return (
-    <SafeArea>
-      <StatusBar barStyle="dark-content" backgroundColor="#131313" />
-      <Providers>{children}</Providers>
-    </SafeArea>
-  );
-};
+const App: React.FC<React.PropsWithChildren> = ({children}) => {};
 
 export default App;
