[Timeout] BlockStatement
src/components/cardProduct/cardProduct.component.tsx:10:7
   image,
   titleEvent,
   detailsPress,
-}) => {
-  return (
-    <S.ImageButton testID="ImageButton" onPress={detailsPress}>
-      <S.ImageCard imageStyle={{borderRadius: 10}} source={image}>
-        <S.Content
-          colors={['#1E20234D', '#191919CC', '#030303']}
-          locations={[0, 0.3, 1]}>
-          <S.Title>{titleEvent}</S.Title>
-          <S.SubTitle>Nunca usada, com 1 bateria junto...</S.SubTitle>
-          <S.Box>
-            <S.Link>Saiba mais</S.Link>
-            <S.PriceText>R$ 1300,00</S.PriceText>
-          </S.Box>
-        </S.Content>
-      </S.ImageCard>
-    </S.ImageButton>
-  );
-};
+}) => {};
 
 export default CardProduct;

[Timeout] ObjectLiteral
src/components/cardProduct/cardProduct.component.tsx:13:32
 }) => {
   return (
     <S.ImageButton testID="ImageButton" onPress={detailsPress}>
-      <S.ImageCard imageStyle={{borderRadius: 10}} source={image}>
+      <S.ImageCard imageStyle={{}} source={image}>
         <S.Content
           colors={['#1E20234D', '#191919CC', '#030303']}

[Timeout] ArrayDeclaration
src/components/cardProduct/cardProduct.component.tsx:15:19
     <S.ImageButton testID="ImageButton" onPress={detailsPress}>
       <S.ImageCard imageStyle={{borderRadius: 10}} source={image}>
         <S.Content
-          colors={['#1E20234D', '#191919CC', '#030303']}
+          colors={[]}
           locations={[0, 0.3, 1]}>
           <S.Title>{titleEvent}</S.Title>

[Timeout] StringLiteral
src/components/cardProduct/cardProduct.component.tsx:15:20
     <S.ImageButton testID="ImageButton" onPress={detailsPress}>
       <S.ImageCard imageStyle={{borderRadius: 10}} source={image}>
         <S.Content
-          colors={['#1E20234D', '#191919CC', '#030303']}
+          colors={["", '#191919CC', '#030303']}
           locations={[0, 0.3, 1]}>
           <S.Title>{titleEvent}</S.Title>

[Timeout] ArrayDeclaration
src/components/cardProduct/cardProduct.component.tsx:16:22
       <S.ImageCard imageStyle={{borderRadius: 10}} source={image}>
         <S.Content
           colors={['#1E20234D', '#191919CC', '#030303']}
-          locations={[0, 0.3, 1]}>
+          locations={[]}>
           <S.Title>{titleEvent}</S.Title>
           <S.SubTitle>Nunca usada, com 1 bateria junto...</S.SubTitle>
