[Timeout] BlockStatement
src/components/cardEvent/cardEvent.component.tsx:13:7
   calendario,
   locationUF,
   detailsPress,
-}) => {
-  return (
-    <S.Content testID="Content" onPress={detailsPress}>
-      <S.ImageCard source={require('@/assets/images/introImage.png')} />
-      <S.Title>{titleEvent}</S.Title>
-      <S.Box>
-        <Icon size={12} name="calendar" color="#900" />
-        <S.InfoText>{calendario}</S.InfoText>
-      </S.Box>
-      <S.Box>
-        <Icon size={12} name="calendar" color="#900" />
-        <S.InfoText>{locationUF}</S.InfoText>
-      </S.Box>
-      <S.Link>Saiba mais</S.Link>
-    </S.Content>
-  );
-};
+}) => {};
 
 export default CardEvent;
