[Timeout] StringLiteral
src/components/cardProduct/styles.ts:6:52
 import LinearGradient from 'react-native-linear-gradient';
 import styled from 'styled-components/native';
 
-export const ImageButton = styled(TouchableOpacity)``;
+export const ImageButton = styled(TouchableOpacity)`Stryker was here!`;
 
 export const Content = styled(LinearGradient)`

[Timeout] StringLiteral
src/components/cardProduct/styles.ts:17:49
   padding: 16px;
 `;
 
-export const ImageCard = styled(ImageBackground)`
-  width: 225px;
-  height: 225px;
-`;
+export const ImageCard = styled(ImageBackground)``;
 
 export const Title = styled(Text)`

[Timeout] StringLiteral
src/components/cardProduct/styles.ts:41:33
   color: ${theme.colors.common.WHITE};
 `;
 
-export const Link = styled(Text)`
-  font-size: 12px;
-  text-decoration: underline;
-  color: ${theme.colors.primary.MAIN};
-  padding-top: 8px;
-`;
+export const Link = styled(Text)``;
 
 export const Box = styled(View)`
