[Timeout] BlockStatement
src/components/cardStore/cardStore.component.tsx:18:50
   detailsPress,
   mapsOpen,
 }) => {
-  const makePhoneCall = (phoneNumber: string) => {
-    if (phoneNumber) {
-      Linking.openURL(`tel:${phoneNumber}`).catch(err =>
-        console.error('Erro ao abrir o discador', err),
-      );
-    }
-  };
+  const makePhoneCall = (phoneNumber: string) => {};
 
   const openWhatsApp = (number: string) => {

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:19:9
   mapsOpen,
 }) => {
   const makePhoneCall = (phoneNumber: string) => {
-    if (phoneNumber) {
+    if (true) {
       Linking.openURL(`tel:${phoneNumber}`).catch(err =>
         console.error('Erro ao abrir o discador', err),

[Timeout] BlockStatement
src/components/cardStore/cardStore.component.tsx:19:22
   mapsOpen,
 }) => {
   const makePhoneCall = (phoneNumber: string) => {
-    if (phoneNumber) {
-      Linking.openURL(`tel:${phoneNumber}`).catch(err =>
-        console.error('Erro ao abrir o discador', err),
-      );
-    }
+    if (phoneNumber) {}
   };
 

[Timeout] ArrowFunction
src/components/cardStore/cardStore.component.tsx:20:51
 }) => {
   const makePhoneCall = (phoneNumber: string) => {
     if (phoneNumber) {
-      Linking.openURL(`tel:${phoneNumber}`).catch(err =>
-        console.error('Erro ao abrir o discador', err),
+      Linking.openURL(`tel:${phoneNumber}`).catch(() => undefined,
       );
     }

[Timeout] BlockStatement
src/components/cardStore/cardStore.component.tsx:26:44
     }
   };
 
-  const openWhatsApp = (number: string) => {
-    let phoneNumber = number.replace(/[^\d]/g, '');
-    if (phoneNumber) {
-      if (phoneNumber.length === 10) {
-        phoneNumber = '55' + phoneNumber;
-      }
-
-      const url = `whatsapp://send?phone=${phoneNumber}`;
-      Linking.openURL(url).catch(err => console.error('Erro', err));
-    }
-  };
+  const openWhatsApp = (number: string) => {};
 
   return (

[Timeout] Regex
src/components/cardStore/cardStore.component.tsx:27:38
   };
 
   const openWhatsApp = (number: string) => {
-    let phoneNumber = number.replace(/[^\d]/g, '');
+    let phoneNumber = number.replace(/[^\D]/g, '');
     if (phoneNumber) {
       if (phoneNumber.length === 10) {

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:28:9
 
   const openWhatsApp = (number: string) => {
     let phoneNumber = number.replace(/[^\d]/g, '');
-    if (phoneNumber) {
+    if (true) {
       if (phoneNumber.length === 10) {
         phoneNumber = '55' + phoneNumber;

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:28:9
 
   const openWhatsApp = (number: string) => {
     let phoneNumber = number.replace(/[^\d]/g, '');
-    if (phoneNumber) {
+    if (false) {
       if (phoneNumber.length === 10) {
         phoneNumber = '55' + phoneNumber;

[Timeout] BlockStatement
src/components/cardStore/cardStore.component.tsx:29:38
   const openWhatsApp = (number: string) => {
     let phoneNumber = number.replace(/[^\d]/g, '');
     if (phoneNumber) {
-      if (phoneNumber.length === 10) {
-        phoneNumber = '55' + phoneNumber;
-      }
+      if (phoneNumber.length === 10) {}
 
       const url = `whatsapp://send?phone=${phoneNumber}`;

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:29:11
   const openWhatsApp = (number: string) => {
     let phoneNumber = number.replace(/[^\d]/g, '');
     if (phoneNumber) {
-      if (phoneNumber.length === 10) {
+      if (false) {
         phoneNumber = '55' + phoneNumber;
       }

[Timeout] ArrowFunction
src/components/cardStore/cardStore.component.tsx:34:34
       }
 
       const url = `whatsapp://send?phone=${phoneNumber}`;
-      Linking.openURL(url).catch(err => console.error('Erro', err));
+      Linking.openURL(url).catch(() => undefined);
     }
   };

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:46:36
         <Icon size={20} name="calendar" />
         <S.InfoText>{endereco}</S.InfoText>
       </S.ButtonLink>
-      <S.ButtonLink onPress={() => telefone && makePhoneCall(telefone)}>
+      <S.ButtonLink onPress={() => false}>
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(telefone)}</S.InfoText>

[Timeout] ConditionalExpression
src/components/cardStore/cardStore.component.tsx:46:36
         <Icon size={20} name="calendar" />
         <S.InfoText>{endereco}</S.InfoText>
       </S.ButtonLink>
-      <S.ButtonLink onPress={() => telefone && makePhoneCall(telefone)}>
+      <S.ButtonLink onPress={() => true}>
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(telefone)}</S.InfoText>

[Timeout] LogicalOperator
src/components/cardStore/cardStore.component.tsx:50:36
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(telefone)}</S.InfoText>
       </S.ButtonLink>
-      <S.ButtonLink onPress={() => wpp && openWhatsApp(wpp)}>
+      <S.ButtonLink onPress={() => wpp || openWhatsApp(wpp)}>
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(wpp)}</S.InfoText>

[Timeout] ArrowFunction
src/components/cardStore/cardStore.component.tsx:50:30
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(telefone)}</S.InfoText>
       </S.ButtonLink>
-      <S.ButtonLink onPress={() => wpp && openWhatsApp(wpp)}>
+      <S.ButtonLink onPress={() => undefined}>
         <Icon size={20} name="calendar" />
         <S.InfoText>{maskPhone(wpp)}</S.InfoText>
