[Timeout] StringLiteral
src/components/cardStore/styles.ts:5:36
 import {View, Text, Image, TouchableOpacity} from 'react-native';
 import styled from 'styled-components/native';
 
-export const Content = styled(View)`
-  width: 200px;
-  height: 250px;
-  border-radius: 8px;
-  background-color: ${theme.colors.background.BLACK_500};
-  margin-right: 8px;
-`;
+export const Content = styled(View)``;
 
 export const ImageCard = styled(Image)`

[Timeout] StringLiteral
src/components/cardStore/styles.ts:29:32
   color: ${theme.colors.primary.MAIN};
 `;
 
-export const Box = styled(View)`
-  flex-direction: row;
-  align-items: center;
-  padding: 0 8px;
-`;
+export const Box = styled(View)``;
 
 export const InfoText = styled(Text)`
