[Timeout] BlockStatement
src/components/cardUser/cardUser.component.tsx:7:77
 import * as S from './styles';
 import {ICardUser} from '@/types';
 
-const cardUser: React.FC<ICardUser> = ({name, type, image, hasInfoUser}) => {
-  return (
-    <S.Container>
-      <S.CardUser>
-        <S.ImageUser
-          testID="ImageUser"
-          source={ExampleImg}
-          resizeMode="cover"
-        />
-      </S.CardUser>
-      {hasInfoUser && (
-        <S.Box>
-          <S.TextName>{name}</S.TextName>
-          <S.TextSub>{type}</S.TextSub>
-        </S.Box>
-      )}
-    </S.Container>
-  );
-};
+const cardUser: React.FC<ICardUser> = ({name, type, image, hasInfoUser}) => {};
 
 export default cardUser;

[Timeout] ConditionalExpression
src/components/cardUser/cardUser.component.tsx:17:8
           resizeMode="cover"
         />
       </S.CardUser>
-      {hasInfoUser && (
-        <S.Box>
-          <S.TextName>{name}</S.TextName>
-          <S.TextSub>{type}</S.TextSub>
-        </S.Box>
-      )}
+      {false}
     </S.Container>
   );

[Timeout] ConditionalExpression
src/components/cardUser/cardUser.component.tsx:17:8
           resizeMode="cover"
         />
       </S.CardUser>
-      {hasInfoUser && (
-        <S.Box>
-          <S.TextName>{name}</S.TextName>
-          <S.TextSub>{type}</S.TextSub>
-        </S.Box>
-      )}
+      {true}
     </S.Container>
   );
