[Timeout] StringLiteral
src/components/cardUser/styles.ts:12:39
   border-radius: 8px;
 `;
 
-export const ImageUser = styled(Image)`
-  width: 30px;
-  height: 30px;
-  border-radius: 8px;
-  border-color: ${theme.colors.primary.MAIN};
-`;
+export const ImageUser = styled(Image)``;
 
 export const TextName = styled(Text)`
