[Timeout] BlockStatement
src/components/customButton/styles.ts:13:24
   background-color: ${theme.colors.primary.MAIN};
   padding: 16px 24px;
   border-radius: 8px;
-  width: ${({size}) => {
-    switch (size) {
-      case 'lg':
-        return '100%';
-      case 'sm':
-        return '200px';
-      case 'xs':
-        return 'auto';
-      default:
-        return '200px';
-    }
-  }};
+  width: ${({size}) => {}};
 `;
 

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:15:7
   border-radius: 8px;
   width: ${({size}) => {
     switch (size) {
-      case 'lg':
-        return '100%';
+      case 'lg':
       case 'sm':
         return '200px';

[Timeout] StringLiteral
src/components/customButton/styles.ts:16:16
   width: ${({size}) => {
     switch (size) {
       case 'lg':
-        return '100%';
+        return "";
       case 'sm':
         return '200px';

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:17:7
     switch (size) {
       case 'lg':
         return '100%';
-      case 'sm':
-        return '200px';
+      case 'sm':
       case 'xs':
         return 'auto';

[Timeout] StringLiteral
src/components/customButton/styles.ts:18:16
       case 'lg':
         return '100%';
       case 'sm':
-        return '200px';
+        return "";
       case 'xs':
         return 'auto';

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:19:7
         return '100%';
       case 'sm':
         return '200px';
-      case 'xs':
-        return 'auto';
+      case 'xs':
       default:
         return '200px';

[Timeout] StringLiteral
src/components/customButton/styles.ts:19:12
         return '100%';
       case 'sm':
         return '200px';
-      case 'xs':
+      case "":
         return 'auto';
       default:

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:21:7
         return '200px';
       case 'xs':
         return 'auto';
-      default:
-        return '200px';
+      default:
     }
   }};

[Timeout] StringLiteral
src/components/customButton/styles.ts:27:59
   }};
 `;
 
-export const TitleButton = styled(Text)<ButtonCustomProps>`
-  text-align: center;
-  font-weight: bold;
-  color: ${theme.colors.secondary.MAIN};
-  font-size: ${({size}) => {
-    switch (size) {
-      case 'lg':
-        return '16px';
-      case 'sm':
-        return '14px';
-      case 'xs':
-        return '12px';
-      default:
-        return '16px';
-    }
-  }};
-`;
+export const TitleButton = styled(Text)<ButtonCustomProps>``;
 

[Timeout] BlockStatement
src/components/customButton/styles.ts:31:28
   text-align: center;
   font-weight: bold;
   color: ${theme.colors.secondary.MAIN};
-  font-size: ${({size}) => {
-    switch (size) {
-      case 'lg':
-        return '16px';
-      case 'sm':
-        return '14px';
-      case 'xs':
-        return '12px';
-      default:
-        return '16px';
-    }
-  }};
+  font-size: ${({size}) => {}};
 `;
 

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:33:7
   color: ${theme.colors.secondary.MAIN};
   font-size: ${({size}) => {
     switch (size) {
-      case 'lg':
-        return '16px';
+      case 'lg':
       case 'sm':
         return '14px';

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:35:7
     switch (size) {
       case 'lg':
         return '16px';
-      case 'sm':
-        return '14px';
+      case 'sm':
       case 'xs':
         return '12px';

[Timeout] StringLiteral
src/components/customButton/styles.ts:36:16
       case 'lg':
         return '16px';
       case 'sm':
-        return '14px';
+        return "";
       case 'xs':
         return '12px';

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:37:7
         return '16px';
       case 'sm':
         return '14px';
-      case 'xs':
-        return '12px';
+      case 'xs':
       default:
         return '16px';

[Timeout] ConditionalExpression
src/components/customButton/styles.ts:39:7
         return '14px';
       case 'xs':
         return '12px';
-      default:
-        return '16px';
+      default:
     }
   }};
