[Timeout] BlockStatement
src/components/floatButton/floatButton.components.tsx:18:35
   const [isLoading, setLoading] = useState(initialLoading);
   const [buttonText, setButtonText] = useState(titleButton);
 
-  const handlePress = async () => {
-    setLoading(true);
-    try {
-      await redirect();
-      setButtonText('Estou participando');
-    } finally {
-      setLoading(false);
-    }
-  };
+  const handlePress = async () => {};
   return (
     <S.Content>

[Timeout] BooleanLiteral
src/components/floatButton/floatButton.components.tsx:19:16
   const [buttonText, setButtonText] = useState(titleButton);
 
   const handlePress = async () => {
-    setLoading(true);
+    setLoading(false);
     try {
       await redirect();

[Timeout] BlockStatement
src/components/floatButton/floatButton.components.tsx:20:9
 
   const handlePress = async () => {
     setLoading(true);
-    try {
-      await redirect();
-      setButtonText('Estou participando');
-    } finally {
+    try {} finally {
       setLoading(false);
     }

[Killed] BlockStatement
src/components/floatButton/floatButton.components.tsx:23:15
     try {
       await redirect();
       setButtonText('Estou participando');
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
   return (
killedBy: All tests
statusReason: > airsoftCommunity@0.0.1 test
> jest --silent --coverage --watchAll=false --maxWorkers=50%


PASS __tests__/components/cardProduct.test.tsx (27.938 s)

PASS __tests__/components/inputCustom.test.tsx
