[Timeout] StringLiteral
src/components/floatButton/styles.ts:6:48
 import LinearGradient from 'react-native-linear-gradient';
 import styled from 'styled-components/native';
 
-export const Container = styled(LinearGradient)`
-  padding: 24px;
-  border-top-right-radius: 10px;
-  border-top-left-radius: 10px;
-  height: 100px;
-  width: 100%;
-  flex-direction: row;
-  align-items: center;
-  justify-content: space-between;
-`;
+export const Container = styled(LinearGradient)``;
 
 export const Title = styled(Text)`

[Timeout] StringLiteral
src/components/floatButton/styles.ts:23:52
   color: ${theme.colors.common.WHITE};
 `;
 
-export const ButtonFloat = styled(TouchableOpacity)`
-  background-color: ${theme.colors.info.WARNING};
-  padding: 16px;
-  border-radius: 10px;
-`;
+export const ButtonFloat = styled(TouchableOpacity)``;
 
 export const Content = styled(View)`

[Timeout] StringLiteral
src/components/floatButton/styles.ts:44:42
   border-radius: 10px;
 `;
 
-export const TitleCalendar = styled(Text)`
-  font-size: 12px;
-  font-weight: bold;
-  color: ${theme.colors.common.WHITE};
-  text-align: center;
-`;
+export const TitleCalendar = styled(Text)``;
 
 export const SubTitleCalendar = styled(Text)`
