[Survived] ArrowFunction
src/components/header/header.component.tsx:20:59
     <S.Content>
       <S.Box>
         {gobackIcon ? (
-          <TouchableOpacity testID="goback-icon" onPress={() => goBack()}>
+          <TouchableOpacity testID="goback-icon" onPress={() => undefined}>
             <Icon
               size={24}
