[Timeout] StringLiteral
src/components/header/styles.ts:26:34
   align-items: center;
 `;
 
-export const Title = styled(Text)`
-  color: ${theme.colors.primary.MAIN};
-  font-size: 14px;
-  font-weight: bold;
-  text-transform: uppercase;
-`;
+export const Title = styled(Text)``;
 
 export const SubTitle = styled(Text)`

[Timeout] StringLiteral
src/components/header/styles.ts:38:49
   font-size: 16px;
 `;
 
-export const CardUser = styled(TouchableOpacity)`
-  width: 40px;
-  height: 40px;
-  border: 1px;
-  border-radius: 8px;
-`;
+export const CardUser = styled(TouchableOpacity)``;
 
 export const ImageUser = styled(Image)`
