[Timeout] BlockStatement
src/components/inputCustom/inputCustom.components.tsx:10:70
   type: 'text' | 'number' | 'password';
 }
 
-const InputCustom: React.FC<InputCustomProps> = ({type, ...rest}) => {
-  let keyboardType: TextInputProps['keyboardType'] = 'default';
-  let secureTextEntry = false;
-
-  if (type === 'number') {
-    keyboardType = 'numeric';
-  } else if (type === 'password') {
-    secureTextEntry = true;
-  }
-
-  return (
-    <S.CustomInput
-      {...rest}
-      placeholderTextColor="#fff"
-      secureTextEntry={secureTextEntry}
-      keyboardType={keyboardType}
-    />
-  );
-};
+const InputCustom: React.FC<InputCustomProps> = ({type, ...rest}) => {};
 
 export default InputCustom;

[Timeout] StringLiteral
src/components/inputCustom/inputCustom.components.tsx:11:54
 }
 
 const InputCustom: React.FC<InputCustomProps> = ({type, ...rest}) => {
-  let keyboardType: TextInputProps['keyboardType'] = 'default';
+  let keyboardType: TextInputProps['keyboardType'] = "";
   let secureTextEntry = false;
 

[Timeout] BooleanLiteral
src/components/inputCustom/inputCustom.components.tsx:12:25
 
 const InputCustom: React.FC<InputCustomProps> = ({type, ...rest}) => {
   let keyboardType: TextInputProps['keyboardType'] = 'default';
-  let secureTextEntry = false;
+  let secureTextEntry = true;
 
   if (type === 'number') {

[Timeout] ConditionalExpression
src/components/inputCustom/inputCustom.components.tsx:14:7
   let keyboardType: TextInputProps['keyboardType'] = 'default';
   let secureTextEntry = false;
 
-  if (type === 'number') {
+  if (false) {
     keyboardType = 'numeric';
   } else if (type === 'password') {

[Timeout] BlockStatement
src/components/inputCustom/inputCustom.components.tsx:14:26
   let keyboardType: TextInputProps['keyboardType'] = 'default';
   let secureTextEntry = false;
 
-  if (type === 'number') {
-    keyboardType = 'numeric';
-  } else if (type === 'password') {
+  if (type === 'number') {} else if (type === 'password') {
     secureTextEntry = true;
   }

[Timeout] ConditionalExpression
src/components/inputCustom/inputCustom.components.tsx:16:14
 
   if (type === 'number') {
     keyboardType = 'numeric';
-  } else if (type === 'password') {
+  } else if (false) {
     secureTextEntry = true;
   }

[Timeout] EqualityOperator
src/components/inputCustom/inputCustom.components.tsx:16:14
 
   if (type === 'number') {
     keyboardType = 'numeric';
-  } else if (type === 'password') {
+  } else if (type !== 'password') {
     secureTextEntry = true;
   }

[Timeout] BooleanLiteral
src/components/inputCustom/inputCustom.components.tsx:17:23
   if (type === 'number') {
     keyboardType = 'numeric';
   } else if (type === 'password') {
-    secureTextEntry = true;
+    secureTextEntry = false;
   }
 
