[Timeout] BlockStatement
src/components/sectionImage/sectionImage.component.tsx:10:7
   title,
   subtitle,
   sizeHeight,
-}) => {
-  return (
-    <S.Content
-      sizeHeight={sizeHeight}
-      testID="content"
-      source={require('@/assets/images/intro2.png')}>
-      <S.Box>
-        <S.Title>{title}</S.Title>
-        <S.SubTitle>{subtitle}</S.SubTitle>
-      </S.Box>
-    </S.Content>
-  );
-};
+}) => {};
 
 export default SectionImage;
