[Timeout] BlockStatement
src/components/sectionImage/styles.ts:12:31
 export const Content = styled(ImageBackground)<ISectionImageProps>`
   width: 100%;
   justify-content: flex-end;
-  height: ${({sizeHeight}) => {
-    switch (sizeHeight) {
-      case 'lg':
-        return '550px';
-      case 'md':
-        return '450px';
-      case 'sm':
-        return '350px';
-      default:
-        return '250px';
-    }
-  }};
+  height: ${({sizeHeight}) => {}};
 `;
 

[Timeout] ConditionalExpression
src/components/sectionImage/styles.ts:14:7
   justify-content: flex-end;
   height: ${({sizeHeight}) => {
     switch (sizeHeight) {
-      case 'lg':
-        return '550px';
+      case 'lg':
       case 'md':
         return '450px';

[Timeout] StringLiteral
src/components/sectionImage/styles.ts:15:16
   height: ${({sizeHeight}) => {
     switch (sizeHeight) {
       case 'lg':
-        return '550px';
+        return "";
       case 'md':
         return '450px';

[Survived] ConditionalExpression
src/components/sectionImage/styles.ts:16:7
     switch (sizeHeight) {
       case 'lg':
         return '550px';
-      case 'md':
-        return '450px';
+      case 'md':
       case 'sm':
         return '350px';

[Timeout] StringLiteral
src/components/sectionImage/styles.ts:16:12
     switch (sizeHeight) {
       case 'lg':
         return '550px';
-      case 'md':
+      case "":
         return '450px';
       case 'sm':

[Timeout] ConditionalExpression
src/components/sectionImage/styles.ts:18:7
         return '550px';
       case 'md':
         return '450px';
-      case 'sm':
-        return '350px';
+      case 'sm':
       default:
         return '250px';

[Timeout] ConditionalExpression
src/components/sectionImage/styles.ts:20:7
         return '450px';
       case 'sm':
         return '350px';
-      default:
-        return '250px';
+      default:
     }
   }};

[Timeout] StringLiteral
src/components/sectionImage/styles.ts:37:37
   text-transform: uppercase;
 `;
 
-export const SubTitle = styled(Text)`
-  color: ${theme.colors.common.WHITE};
-  font-size: 16px;
-`;
+export const SubTitle = styled(Text)``;
 
