[Timeout] StringLiteral
src/components/textIntro/styles.ts:22:51
   color: ${theme.colors.common.WHITE};
 `;
 
-export const ButtonText = styled(TouchableOpacity)`
-  padding-right: 16px;
-`;
+export const ButtonText = styled(TouchableOpacity)``;
 
 export const TextButton = styled(Text)`
