[Killed] BlockStatement
src/components/textIntro/textIntro.components.tsx:11:78
   hasList?: boolean;
 }
 
-const TextIntro: React.FC<ITextIntroProps> = ({title, redirect, hasList}) => {
-  return (
-    <S.Container>
-      <S.ContentIntroText>
-        <S.IntroText>{title}</S.IntroText>
-      </S.ContentIntroText>
-      {hasList && (
-        <S.ButtonText onPress={redirect}>
-          <S.TextButton>Saiba mais</S.TextButton>
-        </S.ButtonText>
-      )}
-    </S.Container>
-  );
-};
+const TextIntro: React.FC<ITextIntroProps> = ({title, redirect, hasList}) => {};
 
 export default TextIntro;
killedBy: All tests
statusReason: > airsoftCommunity@0.0.1 test
> jest --silent --coverage --watchAll=false --maxWorkers=50%


PASS __tests__/components/cardUser.test.tsx (20.622 s)

PASS __tests__/components/customButton.test.tsx

[Timeout] LogicalOperator
src/components/textIntro/textIntro.components.tsx:17:8
       <S.ContentIntroText>
         <S.IntroText>{title}</S.IntroText>
       </S.ContentIntroText>
-      {hasList && (
-        <S.ButtonText onPress={redirect}>
-          <S.TextButton>Saiba mais</S.TextButton>
-        </S.ButtonText>
-      )}
+      {hasList || <S.ButtonText onPress={redirect}>
+          <S.TextButton>Saiba mais</S.TextButton>
+        </S.ButtonText>}
     </S.Container>
   );

[Timeout] ConditionalExpression
src/components/textIntro/textIntro.components.tsx:17:8
       <S.ContentIntroText>
         <S.IntroText>{title}</S.IntroText>
       </S.ContentIntroText>
-      {hasList && (
-        <S.ButtonText onPress={redirect}>
-          <S.TextButton>Saiba mais</S.TextButton>
-        </S.ButtonText>
-      )}
+      {false}
     </S.Container>
   );
