[Timeout] ObjectLiteral
src/mocks/events.mock.ts:2:3
 const eventData = [
-  {
-    id: 1,
-    imageCard: require('@/assets/images/intro2.png'),
-    date: '10 DEZ',
-    title: 'Operação PB-01',
-    subtitle: '10/12/23 - às 8:00 AM',
-  },
+  {},
   {
     id: 2,
