[Timeout] StringLiteral
pages/event/components/styles.ts:23:34
   padding-right: 16px;
 `;
 
-export const Badge = styled(View)`
-  width: 40px;
-  height: 40px;
-  border-bottom-left-radius: 10px;
-  border-bottom-right-radius: 10px;
-  align-items: center;
-  background-color: ${theme.colors.primary.MAIN};
-`;
+export const Badge = styled(View)``;
 
 export const ContentImage = styled(ImageBackground)`

[Timeout] StringLiteral
pages/event/components/styles.ts:32:52
   background-color: ${theme.colors.primary.MAIN};
 `;
 
-export const ContentImage = styled(ImageBackground)`
-  width: 300px;
-  height: 300px;
-  flex-direction: column;
-  justify-content: space-between;
-`;
+export const ContentImage = styled(ImageBackground)``;
 
 export const TextBadge = styled(Text)`

[Timeout] StringLiteral
pages/event/components/styles.ts:39:38
   justify-content: space-between;
 `;
 
-export const TextBadge = styled(Text)`
-  text-align: center;
-  text-transform: uppercase;
-  font-weight: 800;
-  color: #000;
-`;
+export const TextBadge = styled(Text)``;
 
 export const BoxText = styled(LinearGradient)`
