[Timeout] ArrowFunction
src/pages/event/event.components.tsx:15:22
 const Event: React.FC = () => {
   const {navigate} = useNavigation();
 
-  const renderItem = ({item}: {item: IEventCardProps}) => (
-    <EventCard
-      cardHorizontal
-      date={item.date}
-      onClick={() => navigate('EventDetails')}
-      title={item.title}
-      imageCard={item.imageCard}
-      subtitle={item.subtitle}
-    />
-  );
+  const renderItem = () => undefined;
 
   const listRenderItem = ({item}: {item: IEventCardProps}) => (

[Timeout] ArrowFunction
src/pages/event/event.components.tsx:19:16
     <EventCard
       cardHorizontal
       date={item.date}
-      onClick={() => navigate('EventDetails')}
+      onClick={() => undefined}
       title={item.title}
       imageCard={item.imageCard}

[Survived] ArrowFunction
src/pages/event/event.components.tsx:26:26
     />
   );
 
-  const listRenderItem = ({item}: {item: IEventCardProps}) => (
-    <EventCard
-      cardHorizontal={false}
-      date={item.date}
-      onClick={() => navigate('EventDetails')}
-      title={item.title}
-      imageCard={item.imageCard}
-      subtitle={item.subtitle}
-    />
-  );
+  const listRenderItem = () => undefined;
 
   return (

[Timeout] BooleanLiteral
src/pages/event/event.components.tsx:28:23
 
   const listRenderItem = ({item}: {item: IEventCardProps}) => (
     <EventCard
-      cardHorizontal={false}
+      cardHorizontal={true}
       date={item.date}
       onClick={() => navigate('EventDetails')}

[Timeout] StringLiteral
src/pages/event/event.components.tsx:30:31
     <EventCard
       cardHorizontal={false}
       date={item.date}
-      onClick={() => navigate('EventDetails')}
+      onClick={() => navigate("")}
       title={item.title}
       imageCard={item.imageCard}

[Timeout] ArrowFunction
src/pages/event/event.components.tsx:48:29
               horizontal
               data={eventData}
               renderItem={renderItem}
-              keyExtractor={item => item.title}
+              keyExtractor={() => undefined}
             />
           </View>

[Timeout] ArrowFunction
src/pages/event/event.components.tsx:58:27
           <FlatList
             data={eventData}
             renderItem={listRenderItem}
-            keyExtractor={item => item.title}
+            keyExtractor={() => undefined}
           />
         </S.SectionCard>
