[Timeout] StringLiteral
src/pages/event/styles.ts:15:40
   padding-top: 24px;
 `;
 
-export const TextSection = styled(Text)`
-  color: ${theme.colors.primary.MAIN};
-  font-size: 21px;
-  font-weight: 800;
-  line-height: 26px;
-`;
+export const TextSection = styled(Text)``;
 
