[Timeout] StringLiteral
src/pages/eventDetails/styles.ts:5:44
 import {View, Text, ScrollView, TouchableOpacity} from 'react-native';
 import styled from 'styled-components/native';
 
-export const Container = styled(ScrollView)`
-  flex: 1;
-  background-color: ${theme.colors.background.MAIN};
-`;
+export const Container = styled(ScrollView)``;
 
 export const BoxV = styled(ScrollView)`

[Timeout] StringLiteral
src/pages/eventDetails/styles.ts:10:39
   background-color: ${theme.colors.background.MAIN};
 `;
 
-export const BoxV = styled(ScrollView)`
-  margin-bottom: 24px;
-`;
+export const BoxV = styled(ScrollView)``;
 
 export const Box = styled(View)`

[Timeout] StringLiteral
src/pages/eventDetails/styles.ts:44:35
   color: ${theme.colors.primary.MAIN};
 `;
 
-export const BoxRow = styled(View)`
-  flex-direction: row;
-  align-items: center;
-  justify-content: space-between;
-`;
+export const BoxRow = styled(View)``;
 
 export const ContentImageUsers = styled(View)`

[Timeout] StringLiteral
src/pages/eventDetails/styles.ts:87:37
   justify-content: center;
 `;
 
-export const InfoIcon = styled(View)`
-  flex-direction: row;
-  align-items: center;
-`;
+export const InfoIcon = styled(View)``;
 
