[Timeout] BlockStatement
src/pages/Forgot/forgot.page.tsx:7:32
 
 import * as S from './styles';
 
-const Forgot: React.FC = () => {
-  const {navigate} = useNavigation();
-  return (
-    <S.Container>
-      <S.ContentLogo>
-        <S.TitleLogo>Airsoft</S.TitleLogo>
-        <S.SubtitleLogo>CommunityBR</S.SubtitleLogo>
-      </S.ContentLogo>
-      <S.ContentForm>
-        <InputCustom type="text" placeholder="Insira seu email..." />
-        <CustomButton onPress={() => {}} size="lg" title="RESGATAR SENHA" />
-        <S.ContentOpt>
-          <S.Redirect1 onPress={() => navigate('Register')}>
-            <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
-          </S.Redirect1>
-          <S.Redirect1 onPress={() => navigate('Login')}>
-            <S.SubtitleLogo>Login?</S.SubtitleLogo>
-          </S.Redirect1>
-        </S.ContentOpt>
-      </S.ContentForm>
-    </S.Container>
-  );
-};
+const Forgot: React.FC = () => {};
 
 export default Forgot;

[Timeout] ArrowFunction
src/pages/Forgot/forgot.page.tsx:19:33
         <InputCustom type="text" placeholder="Insira seu email..." />
         <CustomButton onPress={() => {}} size="lg" title="RESGATAR SENHA" />
         <S.ContentOpt>
-          <S.Redirect1 onPress={() => navigate('Register')}>
+          <S.Redirect1 onPress={() => undefined}>
             <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
           </S.Redirect1>

[Timeout] ArrowFunction
src/pages/Forgot/forgot.page.tsx:22:33
           <S.Redirect1 onPress={() => navigate('Register')}>
             <S.SubtitleLogo>Sou novo!</S.SubtitleLogo>
           </S.Redirect1>
-          <S.Redirect1 onPress={() => navigate('Login')}>
+          <S.Redirect1 onPress={() => undefined}>
             <S.SubtitleLogo>Login?</S.SubtitleLogo>
           </S.Redirect1>
