[Timeout] StringLiteral
src/pages/Home/home.page.tsx:22:18
       <S.BoxV>
         <SectionImage
           sizeHeight="sm"
-          title={'Bem-vindo ao AirsoftBR'}
+          title={""}
           subtitle={'Veja a operação e equipamentos perto de você'}
         />

[Timeout] ArrowFunction
src/pages/Home/home.page.tsx:28:21
         <TextIntro
           hasList
           title="Próximos eventos"
-          redirect={() => navigate('Event')}
+          redirect={() => undefined}
         />
         <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>

[Timeout] BooleanLiteral
src/pages/Home/home.page.tsx:30:29
           title="Próximos eventos"
           redirect={() => navigate('Event')}
         />
-        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>
+        <S.BoxH horizontal={false} showsHorizontalScrollIndicator={false}>
           <CardEvent
             image={ImgTest}

[Timeout] BooleanLiteral
src/pages/Home/home.page.tsx:30:67
           title="Próximos eventos"
           redirect={() => navigate('Event')}
         />
-        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>
+        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={true}>
           <CardEvent
             image={ImgTest}

[Timeout] ArrowFunction
src/pages/Home/home.page.tsx:36:27
             locationUF="PB"
             titleEvent="Operação PB 01"
             calendario="26/11/23 - 12:00"
-            detailsPress={() => navigate('EventDetails')}
+            detailsPress={() => undefined}
           />
         </S.BoxH>

[Timeout] StringLiteral
src/pages/Home/home.page.tsx:36:42
             locationUF="PB"
             titleEvent="Operação PB 01"
             calendario="26/11/23 - 12:00"
-            detailsPress={() => navigate('EventDetails')}
+            detailsPress={() => navigate("")}
           />
         </S.BoxH>

[Timeout] BooleanLiteral
src/pages/Home/home.page.tsx:41:67
         </S.BoxH>
         {/* anuncios */}
         <TextIntro title="Produtos a venda" hasList />
-        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>
+        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={true}>
           <CardProduct
             image={require('@/assets/images/introImage.png')}

[Timeout] BooleanLiteral
src/pages/Home/home.page.tsx:41:29
         </S.BoxH>
         {/* anuncios */}
         <TextIntro title="Produtos a venda" hasList />
-        <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>
+        <S.BoxH horizontal={false} showsHorizontalScrollIndicator={false}>
           <CardProduct
             image={require('@/assets/images/introImage.png')}

[Timeout] ArrowFunction
src/pages/Home/home.page.tsx:52:21
         <TextIntro
           hasList
           title="Lojas mais proximas"
-          redirect={() => navigate('Store')}
+          redirect={() => undefined}
         />
         <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>

[Timeout] StringLiteral
src/pages/Home/home.page.tsx:52:36
         <TextIntro
           hasList
           title="Lojas mais proximas"
-          redirect={() => navigate('Store')}
+          redirect={() => navigate("")}
         />
         <S.BoxH horizontal={true} showsHorizontalScrollIndicator={false}>

[Timeout] ArrowFunction
src/pages/Home/home.page.tsx:61:27
             titleEvent="Montana Airsoft"
             telefone="83999604027"
             wpp="83999604027"
-            detailsPress={() => navigate('StoreDetails')}
+            detailsPress={() => undefined}
           />
         </S.BoxH>
