[Timeout] StringLiteral
src/pages/Home/styles.ts:5:38
 import {View, Text, ScrollView} from 'react-native';
 import styled from 'styled-components/native';
 
-export const Container = styled(View)`
-  flex: 1;
-  background-color: ${theme.colors.background.MAIN};
-`;
+export const Container = styled(View)``;
 
 export const ContentIntroText = styled(View)`

[Timeout] StringLiteral
src/pages/Home/styles.ts:19:38
   background-color: ${theme.colors.background.THIRD};
 `;
 
-export const IntroText = styled(Text)`
-  font-size: 18px;
-  color: ${theme.colors.common.WHITE};
-`;
+export const IntroText = styled(Text)``;
 
 export const BoxH = styled(ScrollView)`
