[Timeout] StringLiteral
src/pages/Register/styles.ts:13:40
   padding: 24px;
 `;
 
-export const ContentLogo = styled(View)`
-  display: flex;
-  align-items: center;
-  justify-content: flex-start;
-`;
+export const ContentLogo = styled(View)``;
 
 export const TitleLogo = styled(Text)`

[Timeout] StringLiteral
src/pages/Register/styles.ts:19:38
   justify-content: flex-start;
 `;
 
-export const TitleLogo = styled(Text)`
-  font-size: 32px;
-  font-weight: 800;
-  color: ${theme.colors.common.WHITE};
-`;
+export const TitleLogo = styled(Text)``;
 
 export const SubtitleLogo = styled(Text)`
