[Timeout] StringLiteral
pages/Store/components/StoreCard.tsx:25:50
               </S.Badge>
             </S.Box>
             <S.BoxText
-              colors={['#1E20234D', '#191919CC', '#030303']}
+              colors={['#1E20234D', '#191919CC', ""]}
               locations={[0, 0.3, 1]}>
               <S.InfoText>{title}</S.InfoText>

[Timeout] StringLiteral
pages/Store/components/StoreCard.tsx:25:24
               </S.Badge>
             </S.Box>
             <S.BoxText
-              colors={['#1E20234D', '#191919CC', '#030303']}
+              colors={["", '#191919CC', '#030303']}
               locations={[0, 0.3, 1]}>
               <S.InfoText>{title}</S.InfoText>
