[Timeout] StringLiteral
pages/Store/components/styles.ts:17:32
   margin-right: 8px;
 `;
 
-export const Box = styled(View)`
-  width: 100%;
-  align-items: flex-end;
-  padding-right: 16px;
-`;
+export const Box = styled(View)``;
 
 export const Badge = styled(View)`

[Timeout] StringLiteral
pages/Store/components/styles.ts:56:37
   justify-content: flex-end;
 `;
 
-export const InfoText = styled(Text)`
-  font-size: 18px;
-  color: ${theme.colors.common.WHITE};
-  text-transform: uppercase;
-  font-weight: 800;
-`;
+export const InfoText = styled(Text)``;
 
 export const InfoTextSub = styled(Text)`

[Timeout] StringLiteral
pages/Store/components/styles.ts:74:41
   margin-top: 16px;
 `;
 
-export const CardVertical = styled(View)`
-  width: 100%;
-  height: 80px;
-  border-radius: 8px;
-  flex-direction: row;
-  background-color: ${theme.colors.background.BLACK_500};
-`;
+export const CardVertical = styled(View)``;
 
 export const CardImg = styled(Image)`

[Timeout] StringLiteral
pages/Store/components/styles.ts:82:37
   background-color: ${theme.colors.background.BLACK_500};
 `;
 
-export const CardImg = styled(Image)`
-  width: 80px;
-  height: 80px;
-  background-color: red;
-  border-top-left-radius: 8px;
-  border-bottom-left-radius: 8px;
-`;
+export const CardImg = styled(Image)``;
 
 export const InfoBoxText = styled(View)`
