[Timeout] ArrowFunction
src/pages/Store/store.page.tsx:15:22
 const Store: React.FC = () => {
   const {navigate} = useNavigation();
 
-  const renderItem = ({item}: {item: IEventCardProps}) => (
-    <StoreCard
-      cardHorizontal
-      date={item.date}
-      onClick={() => navigate('StoreDetails')}
-      title={item.title}
-      imageCard={item.imageCard}
-      subtitle={item.subtitle}
-    />
-  );
+  const renderItem = () => undefined;
 
   const listRenderItem = ({item}: {item: IEventCardProps}) => (

[Timeout] ArrowFunction
src/pages/Store/store.page.tsx:19:16
     <StoreCard
       cardHorizontal
       date={item.date}
-      onClick={() => navigate('StoreDetails')}
+      onClick={() => undefined}
       title={item.title}
       imageCard={item.imageCard}

[Survived] ArrowFunction
src/pages/Store/store.page.tsx:26:26
     />
   );
 
-  const listRenderItem = ({item}: {item: IEventCardProps}) => (
-    <StoreCard
-      cardHorizontal={false}
-      date={item.date}
-      onClick={() => navigate('StoreDetails')}
-      title={item.title}
-      imageCard={item.imageCard}
-      subtitle={item.subtitle}
-    />
-  );
+  const listRenderItem = () => undefined;
 
   return (

[Timeout] BooleanLiteral
src/pages/Store/store.page.tsx:28:23
 
   const listRenderItem = ({item}: {item: IEventCardProps}) => (
     <StoreCard
-      cardHorizontal={false}
+      cardHorizontal={true}
       date={item.date}
       onClick={() => navigate('StoreDetails')}
