[Timeout] StringLiteral
src/pages/StoreDetails/styles.ts:37:38
   color: ${theme.colors.common.WHITE};
 `;
 
-export const TextPrice = styled(Text)`
-  font-size: 21px;
-  padding-top: 8px;
-  font-weight: bold;
-  color: ${theme.colors.primary.MAIN};
-`;
+export const TextPrice = styled(Text)``;
 
 export const BoxRow = styled(View)`

[Timeout] StringLiteral
src/pages/StoreDetails/styles.ts:69:43
   background-color: ${theme.colors.primary.MAIN};
 `;
 
-export const ContentContact = styled(View)`
-  flex-direction: row;
-  align-items: center;
-  justify-content: space-between;
-  padding-top: 24px;
-`;
+export const ContentContact = styled(View)``;
 
 export const ButtonIcon = styled(TouchableOpacity)`

[Timeout] StringLiteral
src/pages/StoreDetails/styles.ts:76:51
   padding-top: 24px;
 `;
 
-export const ButtonIcon = styled(TouchableOpacity)`
-  background-color: ${theme.colors.background.BLACK_500};
-  padding: 10px;
-  border-radius: 10px;
-  margin-right: 8px;
-  width: 50px;
-  height: 50px;
-  align-items: center;
-  justify-content: center;
-`;
+export const ButtonIcon = styled(TouchableOpacity)``;
 
 export const InfoIcon = styled(View)`
