[Timeout] BlockStatement
src/routes/app.routes.tsx:8:25
 
 const {Navigator, Screen} = createStackNavigator();
 
-const AppRoutes = () => {
-  return (
-    <Navigator screenOptions={{headerShown: false}} initialRouteName="Login">
-      <Screen name="Home" component={Home} />
-      <Screen name="Event" component={Event} />
-      <Screen name="EventDetails" component={EventDetails} />
-      <Screen name="Store" component={Store} />
-      <Screen name="StoreDetails" component={StoreDetails} />
-    </Navigator>
-  );
-};
+const AppRoutes = () => {};
 
 export {AppRoutes};

[Survived] BooleanLiteral
src/routes/app.routes.tsx:10:45
 
 const AppRoutes = () => {
   return (
-    <Navigator screenOptions={{headerShown: false}} initialRouteName="Login">
+    <Navigator screenOptions={{headerShown: true}} initialRouteName="Login">
       <Screen name="Home" component={Home} />
       <Screen name="Event" component={Event} />
