[Survived] BlockStatement
src/routes/home.routes.tsx:8:26
 
 const {Navigator, Screen} = createStackNavigator();
 
-const HomeRoutes = () => {
-  return (
-    <Navigator screenOptions={{headerShown: false}} initialRouteName="Login">
-      <Screen name="Login" component={Login} />
-      <Screen name="Register" component={Register} />
-      <Screen name="Forgot" component={Forgot} />
-    </Navigator>
-  );
-};
+const HomeRoutes = () => {};
 
 export {HomeRoutes};

[Survived] ObjectLiteral
src/routes/home.routes.tsx:10:31
 
 const HomeRoutes = () => {
   return (
-    <Navigator screenOptions={{headerShown: false}} initialRouteName="Login">
+    <Navigator screenOptions={{}} initialRouteName="Login">
       <Screen name="Login" component={Login} />
       <Screen name="Register" component={Register} />
