[Timeout] BlockStatement
src/routes/index.tsx:9:57
 import {AppRoutes} from './app.routes';
 import {HomeRoutes} from './home.routes';
 
-const Routes: React.FC<React.PropsWithChildren> = () => {
-  const {logged} = useAuth();
-
-  console.log('is logged?', logged);
-
-  return (
-    <NavigationContainer>
-      {!logged && <AppRoutes />}
-      {logged && <HomeRoutes />}
-    </NavigationContainer>
-  );
-};
+const Routes: React.FC<React.PropsWithChildren> = () => {};
 
 export default Routes;

[Timeout] StringLiteral
src/routes/index.tsx:12:15
 const Routes: React.FC<React.PropsWithChildren> = () => {
   const {logged} = useAuth();
 
-  console.log('is logged?', logged);
+  console.log("", logged);
 
   return (

[Timeout] ConditionalExpression
src/routes/index.tsx:16:8
 
   return (
     <NavigationContainer>
-      {!logged && <AppRoutes />}
+      {false}
       {logged && <HomeRoutes />}
     </NavigationContainer>

[Timeout] BooleanLiteral
src/routes/index.tsx:16:8
 
   return (
     <NavigationContainer>
-      {!logged && <AppRoutes />}
+      {logged && <AppRoutes />}
       {logged && <HomeRoutes />}
     </NavigationContainer>

[Timeout] ConditionalExpression
src/routes/index.tsx:17:8
   return (
     <NavigationContainer>
       {!logged && <AppRoutes />}
-      {logged && <HomeRoutes />}
+      {false}
     </NavigationContainer>
   );

[Timeout] ConditionalExpression
src/routes/index.tsx:17:8
   return (
     <NavigationContainer>
       {!logged && <AppRoutes />}
-      {logged && <HomeRoutes />}
+      {true}
     </NavigationContainer>
   );
