[Timeout] ObjectLiteral
src/styles/theme/colors.ts:8:9
   secondary: {
     MAIN: '#636363',
   },
-  info: {
-    WARNING: '#FFAA00',
-    SUCCESS: '#198737',
-    DANGER: '#e25858',
-  },
+  info: {},
   background: {
     MAIN: '#1E2023',

[Timeout] ObjectLiteral
src/styles/theme/colors.ts:13:15
     SUCCESS: '#198737',
     DANGER: '#e25858',
   },
-  background: {
-    MAIN: '#1E2023',
-    SECOND: '#191919',
-    THIRD: '#030303',
-    BLACK_500: '#303030',
-    BLACK_400: '#4B4B4B',
-    BLACK_300: '#737373',
-  },
+  background: {},
   gray: {
     MAIN: '#3c3c3c',

[Timeout] StringLiteral
src/styles/theme/colors.ts:19:16
     THIRD: '#030303',
     BLACK_500: '#303030',
     BLACK_400: '#4B4B4B',
-    BLACK_300: '#737373',
+    BLACK_300: "",
   },
   gray: {

[Timeout] ObjectLiteral
src/styles/theme/colors.ts:21:9
     BLACK_400: '#4B4B4B',
     BLACK_300: '#737373',
   },
-  gray: {
-    MAIN: '#3c3c3c',
-    MAIN_2: '#969696',
-    MAIN_3: '#B4B4B4',
-    MAIN_4: '#818181',
-  },
+  gray: {},
   common: {
     WHITE: '#FFF',

[Timeout] StringLiteral
src/styles/theme/colors.ts:23:13
   },
   gray: {
     MAIN: '#3c3c3c',
-    MAIN_2: '#969696',
+    MAIN_2: "",
     MAIN_3: '#B4B4B4',
     MAIN_4: '#818181',

[Timeout] StringLiteral
src/styles/theme/colors.ts:25:13
     MAIN: '#3c3c3c',
     MAIN_2: '#969696',
     MAIN_3: '#B4B4B4',
-    MAIN_4: '#818181',
+    MAIN_4: "",
   },
   common: {

[Timeout] StringLiteral
src/styles/theme/colors.ts:28:12
     MAIN_4: '#818181',
   },
   common: {
-    WHITE: '#FFF',
+    WHITE: "",
     WHITE_F3: '#f3f3f3',
   },
