[Timeout] ObjectLiteral
src/styles/theme/index.ts:6:29
 import fonts from './fonts';
 import colors from './colors';
 
-const theme: DefaultTheme = {
-  fonts,
-  colors,
-};
+const theme: DefaultTheme = {};
 
 export default theme;
