[Timeout] StringLiteral
src/utils/currency.ts:4:14
 export function formatCurrency(
   value: number,
   locale = 'pt-BR',
-  currency = 'BRL',
+  currency = "",
 ): string {
   const formattedCurrency = new Intl.NumberFormat(locale, {

[Timeout] BlockStatement
src/utils/currency.ts:5:11
   value: number,
   locale = 'pt-BR',
   currency = 'BRL',
-): string {
-  const formattedCurrency = new Intl.NumberFormat(locale, {
-    style: 'currency',
-    currency,
-  }).format(value);
-
-  return formattedCurrency;
-}
+): string {}
 

[Timeout] ObjectLiteral
src/utils/currency.ts:6:59
   locale = 'pt-BR',
   currency = 'BRL',
 ): string {
-  const formattedCurrency = new Intl.NumberFormat(locale, {
-    style: 'currency',
-    currency,
-  }).format(value);
+  const formattedCurrency = new Intl.NumberFormat(locale, {}).format(value);
 
   return formattedCurrency;
