[Timeout] BlockStatement
src/utils/maskPhone.ts:1:38
-const maskPhone = (value: string) => {
-  return value
-    .replace(/\D/g, '') // Remove tudo o que não é dígito
-    .replace(/^(\d{2})(\d)/g, '($1) $2') // Coloca parênteses em torno dos dois primeiros dígitos
-    .replace(/(\d)(\d{4})$/, '$1-$2'); // Coloca hífen antes dos últimos 4 dígitos
-};
+const maskPhone = (value: string) => {};
 
 export default maskPhone;

[Timeout] StringLiteral
src/utils/maskPhone.ts:3:21
 const maskPhone = (value: string) => {
   return value
-    .replace(/\D/g, '') // Remove tudo o que não é dígito
+    .replace(/\D/g, "Stryker was here!") // Remove tudo o que não é dígito
     .replace(/^(\d{2})(\d)/g, '($1) $2') // Coloca parênteses em torno dos dois primeiros dígitos
     .replace(/(\d)(\d{4})$/, '$1-$2'); // Coloca hífen antes dos últimos 4 dígitos
