[Timeout] BlockStatement
src/utils/utils.ts:3:55
 import {Linking} from 'react-native';
 
-export const makePhoneCall = (phoneNumber: string) => {
-  if (phoneNumber) {
-    Linking.openURL(`tel:${phoneNumber}`).catch(err =>
-      console.error('Erro ao abrir o discador', err),
-    );
-  }
-};
+export const makePhoneCall = (phoneNumber: string) => {};
 
 export const openWhatsApp = (number: string) => {

[Timeout] ConditionalExpression
src/utils/utils.ts:4:7
 import {Linking} from 'react-native';
 
 export const makePhoneCall = (phoneNumber: string) => {
-  if (phoneNumber) {
+  if (false) {
     Linking.openURL(`tel:${phoneNumber}`).catch(err =>
       console.error('Erro ao abrir o discador', err),

[Timeout] ConditionalExpression
src/utils/utils.ts:4:7
 import {Linking} from 'react-native';
 
 export const makePhoneCall = (phoneNumber: string) => {
-  if (phoneNumber) {
+  if (true) {
     Linking.openURL(`tel:${phoneNumber}`).catch(err =>
       console.error('Erro ao abrir o discador', err),

[Timeout] StringLiteral
src/utils/utils.ts:5:21
 
 export const makePhoneCall = (phoneNumber: string) => {
   if (phoneNumber) {
-    Linking.openURL(`tel:${phoneNumber}`).catch(err =>
+    Linking.openURL(``).catch(err =>
       console.error('Erro ao abrir o discador', err),
     );

[Timeout] BlockStatement
src/utils/utils.ts:11:49
   }
 };
 
-export const openWhatsApp = (number: string) => {
-  let phoneNumber = number.replace(/[^\d]/g, '');
-  if (phoneNumber) {
-    if (phoneNumber.length === 10) {
-      phoneNumber = '55' + phoneNumber;
-    }
-
-    const url = `whatsapp://send?phone=${phoneNumber}`;
-    Linking.openURL(url).catch(err => console.error('Erro', err));
-  }
-};
+export const openWhatsApp = (number: string) => {};
 

[Timeout] BlockStatement
src/utils/utils.ts:13:20
 
 export const openWhatsApp = (number: string) => {
   let phoneNumber = number.replace(/[^\d]/g, '');
-  if (phoneNumber) {
-    if (phoneNumber.length === 10) {
-      phoneNumber = '55' + phoneNumber;
-    }
-
-    const url = `whatsapp://send?phone=${phoneNumber}`;
-    Linking.openURL(url).catch(err => console.error('Erro', err));
-  }
+  if (phoneNumber) {}
 };
 

[Timeout] ConditionalExpression
src/utils/utils.ts:14:9
 export const openWhatsApp = (number: string) => {
   let phoneNumber = number.replace(/[^\d]/g, '');
   if (phoneNumber) {
-    if (phoneNumber.length === 10) {
+    if (true) {
       phoneNumber = '55' + phoneNumber;
     }

[Timeout] EqualityOperator
src/utils/utils.ts:14:9
 export const openWhatsApp = (number: string) => {
   let phoneNumber = number.replace(/[^\d]/g, '');
   if (phoneNumber) {
-    if (phoneNumber.length === 10) {
+    if (phoneNumber.length !== 10) {
       phoneNumber = '55' + phoneNumber;
     }
