[Killed] ConditionalExpression
src/components/textIntro/textIntro.components.tsx:17:8
       <S.ContentIntroText>
         <S.IntroText>{title}</S.IntroText>
       </S.ContentIntroText>
-      {hasList && (
-        <S.ButtonText onPress={redirect}>
-          <S.TextButton>Saiba mais</S.TextButton>
-        </S.ButtonText>
-      )}
+      {true}
     </S.Container>
   );
killedBy: All tests
statusReason: > airsoftCommunity@0.0.1 test
> jest --silent --coverage --watchAll=false --maxWorkers=50%


PASS __tests__/cardProduct.test.tsx (41.723 s)

PASS __tests__/cardUser.test.tsx (41.914 s)
